openresty/openresty-develop-toolkit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>openresty 开发框架</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">openresty 开发框架</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcce7feb">1. 概述</a></li>
<li><a href="#org385adcb">2. 项目结构</a></li>
<li><a href="#orgdaa6873">3. 项目文档</a></li>
<li><a href="#org06c6305">4. 代码结构</a></li>
<li><a href="#org0029725">5. 代码文档</a></li>
<li><a href="#orgb688202">6. 单元测试</a></li>
<li><a href="#org0aae571">7. 接口测试</a></li>
<li><a href="#org7ca8956">8. 打包部署</a>
<ul>
<li><a href="#org014272a">8.1. 传统</a>
<ul>
<li><a href="#org07ff3d1">8.1.1. 安装 openresty</a></li>
<li><a href="#org8e1cf2e">8.1.2. 打包代码</a></li>
</ul>
</li>
<li><a href="#org04ac26c">8.2. 部署代码</a></li>
<li><a href="#org7b2484a">8.3. Docker</a></li>
</ul>
</li>
<li><a href="#org299aa3b">9. 统计监控</a></li>
<li><a href="#org8c860ea">10. 性能测试</a>
<ul>
<li><a href="#orgf0a9199">10.1. 压测</a></li>
<li><a href="#org6bce368">10.2. 定位</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcce7feb" class="outline-2">
<h2 id="orgcce7feb"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
本项目总结 openresty 日常开发的功能和模块，最终目的是规范和简化开发流程、实现低耦合、高内聚的项目。规范的方面主要包括：
</p>

<ul class="org-ul">
<li>项目结构</li>
<li>项目文档</li>
<li>代码结构</li>
<li>代码文档</li>
<li>单元测试</li>
<li>接口测试</li>
<li>打包部署</li>
<li>统计监控</li>
<li>性能测试</li>
</ul>
</div>
</div>

<div id="outline-container-org385adcb" class="outline-2">
<h2 id="org385adcb"><span class="section-number-2">2</span> 项目结构</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>nginx/</code> 主要业务代码。
<ul class="org-ul">
<li><code>lib/</code> 代码中可能会用到的动态链接库（.so）。</li>
<li><code>lua/</code> Lua 核心代码。</li>
<li><code>sbin/</code></li>
</ul></li>
<li><code>doc/</code> 项目文档。</li>
<li><code>script/</code> 辅助脚本。</li>
<li><code>test/</code> 测试脚本，主要是接口测试。</li>
<li><code>CMakeLists.txt</code> 打包配置。</li>
<li><code>build_openresty.sh</code> openresty 安装脚本。</li>
<li><code>install.cmake</code> 安装包制作脚本。</li>
<li><code>Dockerfile</code> openresty-develop-framework 镜像配置。</li>
<li><code>Dockerfile.code</code> 项目代码生成的存储卷镜像配置。</li>
<li><code>README.md</code> 项目说明。</li>
<li><code>mock.sh</code> 建立 mock 环境的脚本。</li>
<li><code>tech.org</code> 介绍框架使用的技术。</li>
</ul>
</div>
</div>

<div id="outline-container-orgdaa6873" class="outline-2">
<h2 id="orgdaa6873"><span class="section-number-2">3</span> 项目文档</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>1_overview</code> 项目详细介绍。</li>
<li><code>2_protocol</code> 项目接口使用的协议。</li>
<li><code>3_environment</code> 项目 <code>mock/develop/pre-release/release</code> 环境的配置。</li>
<li><code>4_sotrage</code> 项目涉及的存储的说明，比如 MySQL、Redis 等。</li>
</ul>
</div>
</div>

<div id="outline-container-org06c6305" class="outline-2">
<h2 id="org06c6305"><span class="section-number-2">4</span> 代码结构</h2>
<div class="outline-text-2" id="text-4">
<p>
主要的业务代码位于 nginx 目录下：
</p>

<ul class="org-ul">
<li><code>conf/</code> nginx 配置文件。</li>
<li><code>doc/</code> 代码文档目录。</li>
<li><code>lib/</code> 项目依赖的第三方库，推荐使用 Luarocks 安装依赖库。</li>
<li><code>lua/</code> 主要业务代码。
<ul class="org-ul">
<li><code>conf/</code> 业务配置。</li>
<li><code>interface/</code> 业务接口。
<ul class="org-ul">
<li><code>inner/</code> 内部接口。</li>
</ul></li>
<li><code>cache/</code> 缓存相关，主要包括业务代码和 redis、memcahe 等接口的封装。</li>
<li><code>database/</code> 持久化数据化，主要包括业务代码和 MySQL 等接口的封装。</li>
<li><code>upstream/</code> 第三方服务接口封装。</li>
<li><code>misc/</code> 工具库</li>
<li><code>mock/</code> 第三方服务 mock 接口。</li>
<li><code>falcon/</code> 上报 falcon 的 metrics 相关封装。</li>
</ul></li>
<li><code>sbin/</code> 和服务运行相关的脚本。</li>
<li><code>config.ld</code> LDoc 配置文件。</li>
</ul>
</div>
</div>

<div id="outline-container-org0029725" class="outline-2">
<h2 id="org0029725"><span class="section-number-2">5</span> 代码文档</h2>
<div class="outline-text-2" id="text-5">
<p>
使用 LDoc 生成 Lua 源码文件的相关文档。详见[LDoc 手册](<a href="https://phenix3443.github.io/notebook/lua/ldoc-manual.html">https://phenix3443.github.io/notebook/lua/ldoc-manual.html</a>)。
</p>
</div>
</div>

<div id="outline-container-orgb688202" class="outline-2">
<h2 id="orgb688202"><span class="section-number-2">6</span> 单元测试</h2>
<div class="outline-text-2" id="text-6">
<p>
使用 LuaUnit 测试 Lua 源码。详见[LuaUnit 实践](<a href="https://phenix3443.github.io/notebook/lua/luaunit.html">https://phenix3443.github.io/notebook/lua/luaunit.html</a>)
</p>

<p>
为了方便测试，除接口外的源码文件中不应该调用 <code>nginx_lua_module</code> 系列的函数。
</p>
</div>
</div>

<div id="outline-container-org0aae571" class="outline-2">
<h2 id="org0aae571"><span class="section-number-2">7</span> 接口测试</h2>
<div class="outline-text-2" id="text-7">
<p>
使用 python3 编写接口测试脚本：
</p>

<ul class="org-ul">
<li><code>Pipfile</code> 使用 pipenv 建立与主机环境隔离的运行环境。</li>
<li><code>config.py</code> 配置文件。</li>
<li><code>log_cfg.py</code> 日志配置文件，使用 python 内置的 logging 库。</li>
<li><code>example_db.py</code> 数据库接口。</li>
<li><code>example_cache.py</code> 缓存接口。</li>
<li><code>upstream.py</code> 第三方服务接口。</li>
<li><code>example_server.py</code> 对应服务接口的 HTTP 客户端。</li>
<li><code>test_example.py</code> 服务接口测试用例。</li>
</ul>
</div>
</div>

<div id="outline-container-org7ca8956" class="outline-2">
<h2 id="org7ca8956"><span class="section-number-2">8</span> 打包部署</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org014272a" class="outline-3">
<h3 id="org014272a"><span class="section-number-3">8.1</span> 传统</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org07ff3d1" class="outline-4">
<h4 id="org07ff3d1"><span class="section-number-4">8.1.1</span> 安装 openresty</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
考虑到最好在生产环境自行安装 openresty，所以打包好的文件没有 nginx 执行程序。
</p>
<div class="org-src-container">
<pre class="src src-sh">./build_openresty.sh &lt;project-dir&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e1cf2e" class="outline-4">
<h4 id="org8e1cf2e"><span class="section-number-4">8.1.2</span> 打包代码</h4>
<div class="outline-text-4" id="text-8-1-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d18aff;">cd</span> build
cmake .. -DCMAKE_INSTALL_PREFIX=&lt;project-dir&gt;
make install
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org04ac26c" class="outline-3">
<h3 id="org04ac26c"><span class="section-number-3">8.2</span> 部署代码</h3>
<div class="outline-text-3" id="text-8-2">
<p>
将打包好的文件替换 <code>openresty/nginx</code> 下的同名文件。
</p>

<p>
如果业务前端有在 nginx 代理，在代理的 <code>nginx.conf</code> 加入以下内容：
</p>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #a1db00;">include</span> &lt;path-to-project&gt;/project.proxy.nginx.conf;
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b2484a" class="outline-3">
<h3 id="org7b2484a"><span class="section-number-3">8.3</span> Docker</h3>
<div class="outline-text-3" id="text-8-3">
<p>
不要将所有代码都放在一个镜像中，最佳实践：以 openresty-develop-framework 镜像挂载项目代码制作的存储卷启动容器。
</p>
</div>
</div>
</div>

<div id="outline-container-org299aa3b" class="outline-2">
<h2 id="org299aa3b"><span class="section-number-2">9</span> 统计监控</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><code>falcon</code> 监控服务运行状态。</li>
<li><code>ELK</code> （todo）全链路跟踪。</li>
</ul>
</div>
</div>

<div id="outline-container-org8c860ea" class="outline-2">
<h2 id="org8c860ea"><span class="section-number-2">10</span> 性能测试</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgf0a9199" class="outline-3">
<h3 id="orgf0a9199"><span class="section-number-3">10.1</span> 压测</h3>
<div class="outline-text-3" id="text-10-1">
<p>
推荐使用 <code>tcpcopy</code> 进行压测。其他工具介绍参见:
</p>

<ul class="org-ul">
<li>[十个免费的 WEB 压力测试工具](<a href="https://coolshell.cn/articles/2589.html">https://coolshell.cn/articles/2589.html</a>)</li>
<li>[哪款网站压力测试工具值得推荐？](<a href="https://www.zhihu.com/question/21861449">https://www.zhihu.com/question/21861449</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org6bce368" class="outline-3">
<h3 id="org6bce368"><span class="section-number-3">10.2</span> 定位</h3>
<div class="outline-text-3" id="text-10-2">
<p>
使用火焰图定位性能瓶颈。详见[openresty-systemtap-toolkit 实践](<a href="https://phenix3443.github.io/notebook/openresty/openresty-systemtap-toolkit.html">https://phenix3443.github.io/notebook/openresty/openresty-systemtap-toolkit.html</a>)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:52</p>
<p class="validation"></p>
</div>
</body>
</html>
